In [1]:
import pandas as pd

In [2]:
data=pd.read_csv("BOOK1.csv")

In [3]:
data

   Name   class   Id
0      A  sec E  332
1      B  sec E  344
2      C  sec D  453
3      D  sec D  435
4      E  sec C  342
5      F  sec C  889
6      G  sec B  977
7      H  sec B  687
8      I  sec A  564
9      J  sec A  577
10     K  sec F  534
11     L  sec E  342
12     M  sec B  768
13     N  sec C  989

In [6]:
data.groupby(["class"])

In [12]:
data.groupby(["class"])["Id"].mean()

class
sec A    570.500000
sec B    810.666667
sec C    740.000000
sec D    444.000000
sec E    339.333333
sec F    534.000000
Name: Id, dtype: float64

In [15]:
data.groupby(["class"]).groups

{'sec A': Int64Index([8, 9], dtype='int64'),
 'sec B': Int64Index([6, 7, 12], dtype='int64'),
 'sec C': Int64Index([4, 5, 13], dtype='int64'),
 'sec D': Int64Index([2, 3], dtype='int64'),
 'sec E': Int64Index([0, 1, 11], dtype='int64'),
 'sec F': Int64Index([10], dtype='int64')}

In [17]:
data.groupby(["class","Id"]).groups

{('sec A', 564): Int64Index([8], dtype='int64'),
 ('sec A', 577): Int64Index([9], dtype='int64'),
 ('sec B', 687): Int64Index([7], dtype='int64'),
 ('sec B', 768): Int64Index([12], dtype='int64'),
 ('sec B', 977): Int64Index([6], dtype='int64'),
 ('sec C', 342): Int64Index([4], dtype='int64'),
 ('sec C', 889): Int64Index([5], dtype='int64'),
 ('sec C', 989): Int64Index([13], dtype='int64'),
 ('sec D', 435): Int64Index([3], dtype='int64'),
 ('sec D', 453): Int64Index([2], dtype='int64'),
 ('sec E', 332): Int64Index([0], dtype='int64'),
 ('sec E', 342): Int64Index([11], dtype='int64'),
 ('sec E', 344): Int64Index([1], dtype='int64'),
 ('sec F', 534): Int64Index([10], dtype='int64')}

In [21]:
data.groupby(["class","Id"])

In [24]:
data.groupby(["class","Id"],as_index=True)

In [22]:
help(data.groupby)

Help on method groupby in module pandas.core.frame:

groupby(by=None, axis=0, level=None, as_index: bool = True, sort: bool = True, group_keys: bool = True, squeeze: bool = False, observed: bool = False) -> 'groupby_generic.DataFrameGroupBy' method of pandas.core.frame.DataFrame instance
    Group DataFrame using a mapper or by a Series of columns.

    A groupby operation involves some combination of splitting the
    object, applying a function, and combining the results. This can be
    used to group large amounts of data and compute operations on these
    groups.

    Parameters
    ----------
    by : mapping, function, label, or list of labels
        Used to determine the groups for the groupby.
        If ``by`` is a function, it's called on each value of the object's
        index. If a dict or Series is passed, the Series or dict VALUES
        will be used to determine the groups (the Series' values are first
        aligned; see ``.align()`` method). If an ndarray is passed, the
        values are used as-is determine the groups. A label or list of
        labels may be passed to group by the columns in ``self``. Notice
        that a tuple is interpreted as a (single) key.
    axis : {0 or 'index', 1 or 'columns'}, default 0
        Split along rows (0) or columns (1).
    level : int, level name, or sequence of such, default None
        If the axis is a MultiIndex (hierarchical), group by a particular
        level or levels.
    as_index : bool, default True
        For aggregated output, return object with group labels as the
        index. Only relevant for DataFrame input. as_index=False is
        effectively "SQL-style" grouped output.
    sort : bool, default True
        Sort group keys. Get better performance by turning this off.
        Note this does not influence the order of observations within each
        group. Groupby preserves the order of rows within each group.
    group_keys : bool, default True
        When calling apply, add group keys to index to identify pieces.
    squeeze : bool, default False
        Reduce the dimensionality of the return type if possible,
        otherwise return a consistent type.
    observed : bool, default False
        This only applies if any of the groupers are Categoricals.
        If True: only show observed values for categorical groupers.
        If False: show all values for categorical groupers.

        .. versionadded:: 0.23.0

    Returns
    -------
    DataFrameGroupBy
        Returns a groupby object that contains information about the groups.

    See Also
    --------
    resample : Convenience method for frequency conversion and resampling
        of time series.

    Notes
    -----
    See the `user guide
    <https://pandas.pydata.org/pandas-docs/stable/groupby.html>`_ for more.

    Examples
    --------
    >>> df = pd.DataFrame({'Animal': ['Falcon', 'Falcon',
    ...                               'Parrot', 'Parrot'],
    ...                    'Max Speed': [380., 370., 24., 26.]})
    >>> df
       Animal  Max Speed
    0  Falcon      380.0
    1  Falcon      370.0
    2  Parrot       24.0
    3  Parrot       26.0
    >>> df.groupby(['Animal']).mean()
            Max Speed
    Animal
    Falcon      375.0
    Parrot       25.0

    **Hierarchical Indexes**

    We can groupby different levels of a hierarchical index
    using the `level` parameter:

    >>> arrays = [['Falcon', 'Falcon', 'Parrot', 'Parrot'],
    ...           ['Captive', 'Wild', 'Captive', 'Wild']]
    >>> index = pd.MultiIndex.from_arrays(arrays, names=('Animal', 'Type'))
    >>> df = pd.DataFrame({'Max Speed': [390., 350., 30., 20.]},
    ...                   index=index)
    >>> df
                    Max Speed
    Animal Type
    Falcon Captive      390.0
           Wild         350.0
    Parrot Captive       30.0
           Wild          20.0
    >>> df.groupby(level=0).mean()
            Max Speed
    Animal
    Falcon      370.0
    Parrot       25.0
    >>> df.groupby(level="Type").mean()
             Max Speed
    Type
    Captive      210.0
    Wild         185.0

In [25]:
arrays = [['Falcon', 'Falcon', 'Parrot', 'Parrot'],['Captive', 'Wild', 'Captive', 'Wild']]
index = pd.MultiIndex.from_arrays(arrays, names=('Animal', 'Type'))
df = pd.DataFrame({'Max Speed': [390., 350., 30., 20.]},index=index)

In [26]:
df

                Max Speed
Animal Type
Falcon Captive      390.0
       Wild         350.0
Parrot Captive       30.0
       Wild          20.0

In [29]:
df.groupby(level=0).mean()

        Max Speed
Animal
Falcon      370.0
Parrot       25.0

In [30]:
df.groupby(level=1).mean()

         Max Speed
Type
Captive      210.0
Wild         185.0

In [32]:
df.groupby(level=0)["Max Speed"].mean()

Animal
Falcon    370.0
Parrot     25.0
Name: Max Speed, dtype: float64

In [33]:
DD=pd.DataFrame({"id":[1,2,3,4,5],"Name":["a","b","a","b","c"],"Branch":["CSE","ECE","CSE","ECE","CSE"]})

In [34]:
DD

   id Name Branch
0   1    a    CSE
1   2    b    ECE
2   3    a    CSE
3   4    b    ECE
4   5    c    CSE

In [39]:
DD.groupby(["Branch"]).mean()

        id
Branch
CSE      3
ECE      3

In [41]:
DD.groupby(["Branch"]).groups

{'CSE': Int64Index([0, 2, 4], dtype='int64'),
 'ECE': Int64Index([1, 3], dtype='int64')}

In [44]:
DD.groupby(["Branch"]).get_group("CSE")

   id Name Branch
0   1    a    CSE
2   3    a    CSE
4   5    c    CSE

In [45]:
DD.groupby(["Branch"]).get_group("ECE")

   id Name Branch
1   2    b    ECE
3   4    b    ECE

In [46]:
DD.corr()

     id
id  1.0

In [47]:
data.corr()

     Id
Id  1.0

In [49]:
DATA=pd.DataFrame({"id":[332,282,847,920,264,751,222],"COA":[12,23,34,32,12,12,12],"CD":[11,22,33,31,11,11,11],"DSP":[32,12,32,12,32,100,100],"WT":[22,2,22,2,22,90,90]})

In [50]:
DATA

    id  COA  CD  DSP  WT
0  332   12  11   32  22
1  282   23  22   12   2
2  847   34  33   32  22
3  920   32  31   12   2
4  264   12  11   32  22
5  751   12  11  100  90
6  222   12  11  100  90

In [51]:
DATA.corr()

           id       COA        CD       DSP        WT
id   1.000000  0.689005  0.689005 -0.106554 -0.106554
COA  0.689005  1.000000  1.000000 -0.586628 -0.586628
CD   0.689005  1.000000  1.000000 -0.586628 -0.586628
DSP -0.106554 -0.586628 -0.586628  1.000000  1.000000
WT  -0.106554 -0.586628 -0.586628  1.000000  1.000000

In [52]:
DATA["WT"].corr(DATA["DSP"])

0.9999999999999998

In [53]:
DATA["DSP"].corr(DATA["DSP"])

0.9999999999999998

In [54]:
DATA["COA"].corr(DATA["DSP"])

-0.5866284950725185